Catalogs/Логины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Логины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Серверы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Логины/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Филиалы.Свернуть("Филиал");
	Параметры.Свернуть("Ключ,Значение");
	
	Для Каждого Строка Из Филиалы Цикл
		Если глСсылкаСуществует(Строка.Филиал) = Ложь Тогда
			Филиалы.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ЛогиныПоВладельцу = Справочники.Логины.Выбрать(,Владелец);
	Пока ЛогиныПоВладельцу.Следующий() Цикл
		Если ЛогиныПоВладельцу.Ссылка <> Ссылка Тогда
			ЛогинОбъект = ЛогиныПоВладельцу.ПолучитьОбъект();
			
			Инд = ЛогинОбъект.Филиалы.Количество() - 1;
			Пока Инд >= 0 Цикл
				ТекущаяСтрока = ЛогинОбъект.Филиалы.Получить(Инд);
				Если Филиалы.Найти(ТекущаяСтрока.Филиал, "Филиал") <> Неопределено Тогда
					ЛогинОбъект.Филиалы.Удалить(Инд);
				КонецЕсли;
				Инд = Инд - 1;
			КонецЦикла;
			
			Если ЛогинОбъект.Модифицированность() Тогда
				ЛогинОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
